Tekla.Structures.ModelInternal.PolygonExtensions
The Tekla.Structures.ModelInternal.PolygonExtensions class provides a set of Tekla-internal extension methods
for Tekla.Structures.Model.Polygon related types.

Tekla.Structures.ModelInternal.PolygonExtensions.ToPolygon(Tekla.Structures.ModelInternal.dotPolygon_t)
Converts the Tekla.Structures.ModelInternal.dotPolygon_t value to a Tekla.Structures.Model.Polygon instance.
dotPolygon: The Tekla.Structures.ModelInternal.dotPolygon_t value to convert.
Returns: The converted Tekla.Structures.Model.Polygon instance.

Tekla.Structures.ModelInternal.PolygonExtensions.ToDotPolygon(Tekla.Structures.Model.Polygon)
Converts the given Tekla.Structures.Model.Polygon instance to a value of Tekla.Structures.ModelInternal.dotPolygon_t.
Throws System.ArgumentNullException: Thrown when the instance to convert from is null.
polygon: The Tekla.Structures.Model.Polygon to convert.
Returns: The converted Tekla.Structures.ModelInternal.dotPolygon_t value.